{
  "title": "China Exports YoY",
  "link": "https://tradingeconomics.com/china/exports-yoy",
  "description": "Exports YoY in China decreased to -0.30 percent in October from 5.70 percent in September of 2022. Exports YoY in China averaged 15.19 percent from 1991 until 2022, reaching an all time high of 154.60 percent in February of 2021 and a record low of -40.60 percent in February of 2020. Export growth has been a major component supporting China's rapid economic expansion. In 2019 China's exports increased 0.5 percent, slowing sharply from a 10 percent rise in 2018, with sales to the US falling sharply amid ongoing trade tensions. Machinery and transport equipment accounted for 48 percent of total exports, in particular electrical machinery, apparatus and appliances (14 percent), telecommunications and sound recording and reproducing apparatus and equipment (12 percent), office machines and automatic data processing machines (8 percent), and general industrial machinery and equipment, and machine parts (5 percent). Other major export categories were: miscellaneous manufactured articles (23 percent) on the back of furniture and parts thereof (3 percent); manufactured goods classified chiefly by material (16 percent) such as textile yarn, fabrics, made-up articles (5 percent), manufactures of metals (4 percent) and iron and steel (2 percent); chemicals and related products (6 percent); and food and live animals (3 percent). The EU and US were the largest destinations of China's shipments, accounting for 17 percent of exports each, followed by Hong Kong (11 percent), Japan (6 percent), South Korea (4 percent), Vietnam (4 percent), Germany (3 percent), India (3 percent) and the Netherlands (3 percent). The UK, Taiwan, Singapore, Malaysia, Russia, Australia, Indonesia, Thailand and the Philippines accounted for 2 percent each. This page includes a chart with historical data for China Exports YoY.",
  "author": "General Administration of Customs",
  "pubDate": "Mon, 07 Nov 2022 07:42:56 GMT"
}