{
  "title": "China Imports YoY",
  "link": "https://tradingeconomics.com/china/imports-yoy",
  "description": "Imports YoY in China decreased to -0.70 percent in October from 0.30 percent in September of 2022. Imports YoY in China averaged 14.78 percent from 1991 until 2022, reaching an all time high of 85.50 percent in January of 2010 and a record low of -43.10 percent in January of 2009. In 2019 imports to China fell 2.7 percent, the first yearly decline in three years, on weak domestic demand and persistent trade tensions with the US. Machinery and transport equipment accounted for 38 percent of total imports on the back of electrical machinery, apparatus and appliances (21 percent), road vehicles (4 percent), telecommunications and sound recording and reproducing apparatus and equipment (3 percent), and office machines and automatic data processing machines (3 percent). Other important categories were: mineral fuels, lubricants and related materials (17 percent) led by petroleum, petroleum products and related materials (13 percent) and gas, natural and manufactured (3 percent); crude materials, inedible, except fuels (14 percent), such as metalliferous ores and metal scrap (9 percent); chemicals and related products (11 percent) due to organic chemicals (3 percent) and plastics in primary forms (3 percent); miscellaneous manufactured articles (7 percent); manufactured goods classified chiefly by material (7 percent); and food and live animals (4 percent). The biggest source of imports was the EU (13 percent of imports) of which Germany (5 percent) and France (2 percent), followed by South Korea, Taiwan, Japan (8 percent each), the US and Australia (6 percent each), Brazil (4 percent), Malaysia, Vietnam, Russia and Saudi Arabia (3 percent each), and Thailand, Singapore and Indonesia (2 percent each). This page includes a chart with historical data for China Imports YoY.",
  "author": "General Administration of Customs",
  "pubDate": "Mon, 07 Nov 2022 07:40:11 GMT"
}